[
  {
    "text": "Sach bolun toh recruiter ka reply na aana tumhari galti nahi hoti. Yeh cheez mujhe kaafi late samajh aayi.",
    "engagement": 664
  },
  {
    "text": "Maine yeh cheez hard way se seekhi hai: career growth straight line mein nahi hoti.",
    "engagement": 158
  },
  {
    "text": "Unpopular opinion: rejections do not define your capability.",
    "engagement": 275
  },
  {
    "text": "Unpopular opinion: silence from recruiters is a system failure, not a personal one.",
    "engagement": 975
  },
  {
    "text": "Unpopular opinion: skills matter more than job titles.",
    "engagement": 457
  },
  {
    "text": "Sach bolun toh recruiter ka reply na aana tumhari galti nahi hoti. Yeh cheez mujhe kaafi late samajh aayi.",
    "engagement": 255
  },
  {
    "text": "Hard truth: career growth is not always linear. Most people realize this very late in their career.",
    "engagement": 533
  },
  {
    "text": "If you are struggling right now, remember this: rejections do not define your capability. You are not alone.",
    "engagement": 717
  },
  {
    "text": "Nobody talks about this but burnout is often mistaken as lack of discipline. Read that again.",
    "engagement": 347
  },
  {
    "text": "I learned this the hard way: silence from recruiters is a system failure, not a personal one.",
    "engagement": 905
  },
  {
    "text": "Unpopular opinion par sach yeh hai ki skills, title se zyada important hoti hain.",
    "engagement": 1410
  },
  {
    "text": "LinkedIn pe sab perfect dikhata hai, lekin reality yeh hai ki toxic manager achi job ko bhi nightmare bana deta hai.",
    "engagement": 1066
  },
  {
    "text": "Maine yeh cheez hard way se seekhi hai: skills, title se zyada important hoti hain.",
    "engagement": 196
  },
  {
    "text": "Unpopular opinion par sach yeh hai ki rejection tumhari worth decide nahi karta.",
    "engagement": 669
  },
  {
    "text": "Agar aaj tum confused ho, toh yaad rakho: career growth straight line mein nahi hoti.",
    "engagement": 411
  },
  {
    "text": "Agar aaj tum confused ho, toh yaad rakho: burnout ka matlab weak hona nahi hota.",
    "engagement": 1411
  },
  {
    "text": "I learned this the hard way: rejections do not define your capability.",
    "engagement": 936
  },
  {
    "text": "Nobody talks about this but burnout is often mistaken as lack of discipline. Read that again.",
    "engagement": 1306
  },
  {
    "text": "Unpopular opinion par sach yeh hai ki rejection tumhari worth decide nahi karta.",
    "engagement": 694
  },
  {
    "text": "Unpopular opinion: a toxic manager can destroy confidence faster than failure.",
    "engagement": 597
  },
  {
    "text": "If you are struggling right now, remember this: skills matter more than job titles. You are not alone.",
    "engagement": 691
  },
  {
    "text": "I learned this the hard way: most people are just pretending to have it all figured out.",
    "engagement": 341
  },
  {
    "text": "Unpopular opinion par sach yeh hai ki skills, title se zyada important hoti hain.",
    "engagement": 432
  },
  {
    "text": "LinkedIn pe sab perfect dikhata hai, lekin reality yeh hai ki break lena laziness nahi hota.",
    "engagement": 855
  },
  {
    "text": "I learned this the hard way: burnout is often mistaken as lack of discipline.",
    "engagement": 190
  }
]